; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite7 - satellite
	instrument13 - instrument
	instrument14 - instrument
	infrared2 - mode
	image0 - mode
	infrared1 - mode
	Star2 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star0 - direction
	Star1 - direction
	Star3 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument3 infrared2)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument6 image0)
	(supports instrument6 infrared1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 Star5)
	(supports instrument8 infrared1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument9 infrared2)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 Star1)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star1)
	(supports instrument10 image0)
	(calibration_target instrument10 Star1)
	(calibration_target instrument10 Star5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star2)
	(supports instrument11 infrared2)
	(calibration_target instrument11 Star0)
	(calibration_target instrument11 Star6)
	(supports instrument12 image0)
	(supports instrument12 infrared1)
	(supports instrument12 infrared2)
	(calibration_target instrument12 Star1)
	(calibration_target instrument12 Star3)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star0)
	(supports instrument13 infrared1)
	(supports instrument13 infrared2)
	(supports instrument13 image0)
	(calibration_target instrument13 Star1)
	(calibration_target instrument13 Star0)
	(supports instrument14 image0)
	(calibration_target instrument14 Star3)
	(calibration_target instrument14 Star1)
	(on_board instrument13 satellite7)
	(on_board instrument14 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star2)
)
(:goal (and
	(pointing satellite1 Star2)
	(pointing satellite5 Star0)
	(have_image Phenomenon7 infrared2)
	(have_image Planet8 image0)
	(have_image Phenomenon9 infrared1)
	(have_image Planet10 infrared1)
	(have_image Star11 image0)
	(have_image Planet12 infrared2)
	(have_image Phenomenon13 image0)
))

)

; plan
1. (turn_to satellite5 star0 star2)
   deleted: (pointing satellite5 star2)
   added: (pointing satellite5 star0)
   goals met: 1 of 9
2. (turn_to satellite1 star3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star3)
   goals met: 1 of 9
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 9
4. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 1 of 9
5. (turn_to satellite1 planet10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet10)
   goals met: 1 of 9
6. (take_image satellite1 planet10 instrument2 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 2 of 9
7. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 9
8. (take_image satellite1 phenomenon9 instrument2 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 3 of 9
9. (turn_to satellite1 phenomenon7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 9
10. (take_image satellite1 phenomenon7 instrument2 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 4 of 9
11. (turn_to satellite1 phenomenon13 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon13)
   goals met: 4 of 9
12. (take_image satellite1 phenomenon13 instrument2 image0)
   added: (have_image phenomenon13 image0)
   goals met: 5 of 9
13. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   goals met: 5 of 9
14. (take_image satellite1 planet12 instrument2 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 6 of 9
15. (turn_to satellite1 planet8 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet8)
   goals met: 6 of 9
16. (take_image satellite1 planet8 instrument2 image0)
   added: (have_image planet8 image0)
   goals met: 7 of 9
17. (turn_to satellite1 star11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star11)
   goals met: 7 of 9
18. (take_image satellite1 star11 instrument2 image0)
   added: (have_image star11 image0)
   goals met: 8 of 9
19. (turn_to satellite1 star2 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star2)
   goals met: 9 of 9
